a = int(input("Введите число: "))
b = int(input("Введите число: "))
c = int(input("Введите число: "))

print("Сумма: ", a + b, "разность: ", a - b, "произведение: ", a * b, "деление: ", a / b, "возведение в степень: ", a **b)
print("Сумма: ", a + c, "разность: ", a - c, "произведение: ", a * c, "деление: ", a / c, "возведение в степень: ", a **c)
print("Сумма: ", b + c, "разность: ", b - c, "произведение: ", b * c, "деление: ", b / c, "возведение в степень: ", b **c)
print("Разность: ", b - a, "деление: ", b / a, "возведение в степень: ", b ** a)
print("Разность: ", c - a, "деление: ", c / a, "возведение в степень: ", c ** a)
print("Разность: ", c - b, "деление: ", c / b, "возведение в степень: ", c ** b)

print("Сумма: ", a + b + c, "разность: ", a - b - c, "произведение: ", a * b * c, "деление: ", a / b / c)
print("Разность: ", b - a - c, "деление: ", b / a / c)
print("Разность: ", c - a - b, "деление: ", c / a / b)
