# Необходимо написать программу, которая требует у пользователя
# ввести два целых числа, строку и одно дробное число, далее выводит
# на экран строку и сумму двух целых и дробного чисел

a = int(input("Введите первое целое число: "))
b = int(input("Введите второе целое число: "))
c = input("Введите строку: ")
d = float(input("Введите дробное число: "))

# Сумма целых чисел и дробного
t = a + b +d

print(c)
print(t)