#1.Два метода в классе, один принимает в себя либо строку, либо число.
#Если я передаю строку, то смотрим: 
#если произведение гласных и согласных букв меньше или равно длине слова, выводить все гласные, иначе согласные; 
#если число то, произведение суммы чётных цифр на длину числа. 
#Длину строки и числа искать во втором методе.



#2.1.Необходимо реализовать модель человека.
# Человек может есть, работать, играть, ходить в магазин.
# У человека есть степень сытости, немного еды и денег.
# Если сытость < 0 единиц, человек умирает.
# Человеку надо прожить 365 дней.
# 2.2.Создать двух людей, живущих в одном доме - Бивиса и Батхеда
# Нужен класс Дом, в нем должн быть холодильник с едой и тумбочка с деньгами
# Еда пусть хранится в холодильнике в доме, а деньги - в тумбочке.
