
#Homework - 02 Tasks
#Цель:
#Закрепить знания по работе с If, Elif, Else.
#Примечание:
#Все задания выполнять в отдельных файлах. Имена файлов: task_2_x.py, где x это
#номер задания(для первого задания - task_2_1.py). Все начальные данные задаются произвольно.

#1. Ввести предложение. Если в предложении есть слово code - вывести на экран Yes, иначе вывести на экран Nо
#Подсказка: Оператор in string = 'Hello' if 'e' in string: print('YES') else: print('NO')

#2. Запросить у пользователя возраст. Если возраст меньше 0 - вывести Wrong input, если меньше 18 - вывести CocaCola, иначе - вывести Beer

#3. Ввести строку с клавиатуры Если длина строки больше 5 - вывести значение на экран
#Если длина строки меньше 5 - вывести строку “Need more!” Если длина строки равна 5 - вывести строку “It is five”

#4. Ввести число, проверить на то, что было введено именно число. Возвести его в куб

#5. Получить на ввод количество рублей и копеек и вывести в правильной форме, например, 3 рубля, 1 рубль 25 копеек, 3 копейки

#6. Ввести почтовый адрес. Проверить доменной имя. В случае если оно gmail.com, вывести на экран имя почтового ящика. Иначе вывести надпись “ DOMAIN NAME is not supported’
#см. подсказку для первого задания

#7. По номеру месяца вывести кол-во дней в нем (без указания названия месяца, в феврале 28 дней) Результат проверки вывести на консоль Если номер
#месяца некорректен - сообщить об этом Номер месяца получать от пользователя следующим образом:
#user_input = input("Введите, пожалуйста, номер месяца: ")
#month = int(user_input) print('Вы ввели', month)

#8. Определить, является ли год високосным

#9. Определить существование треугольника и его тип

#10. BOSS TASK
#Заданы размеры envelop_x, envelop_y - размеры конверта и paper_x, paper_y листа бумаги Определить, поместится ли бумага в конверте (стороны листа параллельны сторонам конверта)
#Результат проверки вывести на консоль (ДА/НЕТ) Использовать только операторы if/elif/else, можно вложенные
#envelop_x, envelop_y = 10, 7
#paper_x, paper_y = 8, 9
#проверить для
#paper_x, paper_y = 9, 8
#paper_x, paper_y = 6, 8
#paper_x, paper_y = 8, 6
#paper_x, paper_y = 3, 4
#paper_x, paper_y = 11, 9
#paper_x, paper_y = 9, 11
#(просто раскоментировать нужную строку и проверить свой код)
