#Дана следующая функцияу
# y = 2x - 10, если > 0
# y = 0, если х = 0
# y = 2 *|x| - 1, - 1, если х < 0

x = int(input())

if x > 0:
    y = 2 *x -19
elif x == 0:
    y = 0
else:
    y = 2 * abs(x) - 1

print(y)
