#Создайте новый проект. С помощь консоли Git создайте локальный репозиторий.
#В локальном репозитории добавьте новый текстовый файл. Затем создайте новую ветку и измените в ней текстовый файл.
#После чего соедините ветки.
#Локальный репозиторий опубликуйте на GitHub

#Оформление:
#Делаете скриншоты своих действий в командной строке, 
#вставляете их в текстовый документ с комментарием, а
#Также ссылку на удалённый репозиторий. 
#Документ называете своим именем и группой, затем 
#высылаете мне в личное сообщение
